app/controllers/home_controller.rb

  def index
    @poppies = Poppy.search(params[:search],params[:age])
    @categories = Poppy.uniq.pluck(:kind)
    @age = Poppy.uniq.pluck(:age)
---
SELECT "poppies".* FROM "poppies" WHERE (kind LIKE 'abc') AND (name LIKE '이름')
SELECT DISTINCT "poppies"."kind" FROM "poppies"
SELECT DISTINCT "poppies"."age" FROM "poppies"